app/views/articles/index.html.erb

						<a class="btn waves-effect waves-light light-blue f-black"><i class="material-icons left">visibility</i><%= article.visits_count %></a>
						<a class="btn waves-effect waves-light f-black"><i class="material-icons left">message</i><%= article.comments.count %> </a>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]