app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 4]]
---
			<div id="comments-box">
				<% @article.comments.each do |comment| %>