app/controllers/articles_controller.rb

	def show
		@article.update_visits_count
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2015-11-29 22:32:24.005701"], ["id", 2]]

	def new
		@article = Article.new
		@categories = Category.all
---
SELECT "categories".* FROM "categories"

	def create
		@article = current_user.articles.new(article_params)
		@article.categories = params[:categories]
		if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["article_id", 12], ["created_at", "2015-12-01 02:36:10.419603"], ["updated_at", "2015-12-01 02:36:10.419603"]]

	def update
		if @article.update(article_params)
---
UPDATE "articles" SET "cover_updated_at" = ?, "cover_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["cover_updated_at", "2015-11-30 03:32:31.864469"], ["cover_file_name", "php_wallpaper_by_designphilic-d4omoup.jpg"], ["updated_at", "2015-11-30 03:32:32.115812"], ["id", 2]]