app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Diseño"], ["color", "#613da5"], ["created_at", "2015-11-30 23:37:01.534306"], ["updated_at", "2015-11-30 23:37:01.534306"]]