app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Primer comentario mama"], ["user_id", 1], ["article_id", 4], ["created_at", "2015-11-29 23:20:57.406214"], ["updated_at", "2015-11-29 23:20:57.406214"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_article
      @article = Article.find(params[:article_id])